---
kind: method
id: M:Autodesk.Revit.DB.PerformanceAdviser.GetRuleDescription(System.Int32)
source: html/00e4ff47-36d6-4183-57d0-6a1992dd9ffb.htm
---
# Autodesk.Revit.DB.PerformanceAdviser.GetRuleDescription Method

Retrieves the description of the rule.

## Syntax (C#)
```csharp
public string GetRuleDescription(
	int index
)
```

## Parameters
- **index** (`System.Int32`) - The rule index to get information for.

## Returns
The description of the rule.